{
  "Mines": [
    {
      "roll": "1",
      "description": "1 Ambush Attack - There are fiendish creatures and demons in the dark places of the world! Ambush Attack! Draw a threat to immediately Ambush the Heroes."
    },
    {
      "roll": "2",
      "description": "2 Dark Dread – Things are looking more and more bleak by the moment! Draw a Growing Dread card to add to the stack."
    },
    {
      "roll": "3",
      "description": "3 Creeping Darkness – The Darkness is always searching for a way out! Move the Darkness 2 steps forward on the Depth Track."
    },
    {
      "roll": "4",
      "description": "4 Falling Rubble – The rocky ceiling of the mine shaft is unstable and prone to collapse. Each Hero in the Mines immediately takes D6 Hits."
    },
    {
      "roll": "5",
      "description": "5 Terrifying Shriek – A shriek of pain and suffering echoes through the mine, chilling you to the bone. Each Hero in the Mines immediately takes D6 Horror Hits."
    },
    {
      "roll": "6",
      "description": "6 Stubborn Resolve – This place is horrible and unforgiving, but you’re not about to give up without a fight! Each Hero may immediately Heal D6 Wounds/Sanity (any mix) or Recover 1 Grit. KO’d Heroes may immediately Recover, rolling for their Injury/Madness and Healing 2D6 Wounds/Sanity (any mix) as normal for Recovering."
    }
  ],
  "Targa": [
    {
      "roll": "1",
      "description": "1 Ambush Attack - There are fiendish creatures and demons in the dark places of the world! Ambush Attack! Draw a threat to immediately Ambush the Heroes."
    },
    {
      "roll": "2",
      "description": "2 Dark Dread – Things are looking more and more bleak by the moment! Draw a Growing Dread card to add to the stack."
    },
    {
      "roll": "3",
      "description": "3 Creeping Darkness – The Darkness is always searching for a way out! Move the Darkness 2 steps forward on the Depth Track."
    },
    {
      "roll": "4",
      "description": "4 Blizzard – The icy chill turns to whipping winds as a blizzard sets in! – Weather- While in Targa Plateau, a Hero takes 1 automatic Hit at the start of each turn."
    },
    {
      "roll": "5",
      "description": "5 Echoes of Death – For a moment, ghostly figues of a long-dead race can be seen moving through the halls. As you look on in disbelief, one of them stops… and looks back at you. One Random Hero in the Targa Plateau immediately takes 2D6 Horror Hits."
    },
    {
      "roll": "6",
      "description": "6 Treasures of the Past – Though the ancient city has long been abandoned, valuable items can still be found, often just laying around as though the previous inhabitants just vanished. Each Hero may immediately draw a Loot card. KO’d Heroes may immediately Recover, rolling for their Injury/Madness and Healing 2D6 Wounds/Sanity (any mix) as normal for Recovering."
    }
  ],
  "Jargono": [
    {
      "roll": "1",
      "description": "1 Ambush Attack - There are fiendish creatures and demons in the dark places of the world! Ambush Attack! Draw a threat to immediately Ambush the Heroes."
    },
    {
      "roll": "2",
      "description": "2 Dark Dread – Things are looking more and more bleak by the moment! Draw a Growing Dread card to add to the stack."
    },
    {
      "roll": "3",
      "description": "3 Creeping Darkness – The Darkness is always searching for a way out! Move the Darkness 2 steps forward on the Depth Track."
    },
    {
      "roll": "4",
      "description": "4 Volley of Arrows – A volley of serpentman arrows rains down from the treetops above! Each Hero in Jargono takes 3 Hits. Any Hero that takes 1 or more Wounds, also gains a Poison marker."
    },
    {
      "roll": "5",
      "description": "5 Tribal Drums – In the distance, you hear the thundering war drums of a savage tribe. They’re getting louder and louder with every step you take. Each Hero in Jargono must discard 1 Grit or take D6 Sanity damage with no Willpower saves."
    },
    {
      "roll": "6",
      "description": "6 Fountain of Life – A wellspring bubbles up here, rejuvenating all that touches its waters! Each Hero may immediately Heal D6 Wounds/Sanity (any mix) and remove any Poison markers on them. KO’d Heroes may immediately Recover, rolling for their Injury/Madness and Healing 2D6 Wounds/Sanity (any mix) as normal for Recovering."
    }
  ],
  "Cynder": [
    {
      "roll": "1",
      "description": "1 Ambush Attack - There are fiendish creatures and demons in the dark places of the world! Ambush Attack! Draw a threat to immediately Ambush the Heroes."
    },
    {
      "roll": "2",
      "description": "2 Dark Dread – Things are looking more and more bleak by the moment! Draw a Growing Dread card to add to the stack."
    },
    {
      "roll": "3",
      "description": "3 Creeping Darkness – The Darkness is always searching for a way out! Move the Darkness 2 steps forward on the Depth Track."
    },
    {
      "roll": "4",
      "description": "4 Fires of Cynder – The Corrupting flames of Cynder erupt all around, burning the Heroes! Each Hero in Cynder takes D3 Burning Markers and 1 Corruption Point, ignoring Willpower."
    },
    {
      "roll": "5",
      "description": "5 The Burden of Judgment – Shrieks of agony and torment echo through your mind as the dark eye of judgment falls on you, scrutinizing your worthiness. Each Hero in Cynder immediately takes 2 Sanity Damage, ignoring Willpower, for each Corruption Point he/she has."
    },
    {
      "roll": "6",
      "description": "6 Flicker of Hope – A flicker of hope can be seen through the flashing flames… you must press on! Each Hero may immediately remove any Burning Markers they have as well as to either Heal 2D6 Wounds/Sanity (any mix) or remove D6 Corruption Points. KO’d Heroes may immediately Recover, rolling for their Injury/Madness and Healing 2D6 Wounds/Sanity (any mix) as normal for Recovering."
    }
  ],
  "DerelictShip": [
    {
      "roll": "1",
      "description": "1 Ambush Attack - There are fiendish creatures and demons in the dark places of the world! Ambush Attack! Draw a threat to immediately Ambush the Heroes."
    },
    {
      "roll": "2",
      "description": "2 Dark Dread – Things are looking more and more bleak by the moment! Draw a Growing Dread card to add to the stack."
    },
    {
      "roll": "3",
      "description": "3 Creeping Darkness – The Darkness is always searching for a way out! Move the Darkness 2 steps forward on the Depth Track."
    },
    {
      "roll": "4",
      "description": "4 Hull Breach – Explosions rock the ship as a Hull Breach tears open nearby! –Space- Select a Random Hero’s Map Tile, and a Random Exit on that Map Tile (either an open Door or an End Cap) to find the location of the Hull Breach (Re-roll a new Hero if no valid exits on the Map Tile). Roll D6 to determine the Size of the Breach. Every Hero is immediately pulled a number of spaces equal to the Size of the Breach along the shortest path toward it (starting with the Hero closest to the Breach). Every Hero also takes a number of Hits equal to the Size of the Breach. Any Hero that is moved into one of the two spaces of the open Door/End Cap, is pulled through, taking 2D6 Wounds, ignoring Defense, before clawing their way back inside the ship. The Breach is then sealed by a force field."
    },
    {
      "roll": "5",
      "description": "5 Echoes of Death – A wave of pure terror washes over you, flickering flashes of nightmares in your mind! Each Hero takes D6 Horror Hits. If the total Sanity Damage taken is equal to or greater than the number of Heroes in the Posse, also add a Growing Dread card to the stack."
    },
    {
      "roll": "6",
      "description": "6 Hope for the Future – Seeing how far technology has advanced gives you hope for humanity’s future. Each Hero may immediately Heal 2D6 Wounds/Sanity (any mix) or cancel a Darkness or Growing Dread card on a D6 roll of 4+. KO’d Heroes may immediately Recover, rolling for their Injury/Madness and Healing 2D6 Wounds/Sanity (any mix) as normal for Recovering."
    }
  ],
  "Trederra": [
    {
      "roll": "1",
      "description": "1 Ambush Attack - There are fiendish creatures and demons in the dark places of the world! Ambush Attack! Draw a threat to immediately Ambush the Heroes."
    },
    {
      "roll": "2",
      "description": "2 Dark Dread – Things are looking more and more bleak by the moment! Draw a Growing Dread card to add to the stack."
    },
    {
      "roll": "3",
      "description": "3 Creeping Darkness – The Darkness is always searching for a way out! Move the Darkness 2 steps forward on the Depth Track."
    },
    {
      "roll": "4",
      "description": "4 Incoming – A terrifying whistle shrieks across the sky right before the ground erupts in explosions! Each Hero in Trederra takes 2D6 Hits from flying debris."
    },
    {
      "roll": "5",
      "description": "5 Marching in the Streets – The sound of marching echoes through the streets as a massive column of Trederran soldiers march to the front lines. Add D3 Patrol Markers to the Depth Track, but do NOT roll for Discovery."
    },
    {
      "roll": "6",
      "description": "6 Break in the Clouds – A break in the toxic clouds overhead lets the cold light of Trederra’s sun shine through. Cancel all Weather effects. Each Hero may immediately remove any Poison and Stunned Markers they have as well as either Heal 2D6 Wounds/Sanity (any mix) or remove D6 Corruption Points. KO’d Heroes may immediately Recover, rolling for their Injury/Madness and Healing 2D6 Wounds/Sanity (any mix) as normal for Recovering."
    }
  ],
  "Town": [
    {
      "roll": "1",
      "description": "1 Rooftop Ambush – Bandits! On the Roof! Immediately add D3 Bandits to the board, each on a Random Building’s Rooftop. These Bandits replace their Bandit Pistol with Bandit Rifles (as detailed in the Shootout in the Streets mission). For any of these Bandits that cannot be placed, move the Darkness forward 1 space on the Depth Track instead."
    },
    {
      "roll": "2",
      "description": "2 Building Fire – One of the buildings in Town has caught fire! Roll a Random Building and place a marker on it showing it is burning. Any model that ends their Move in a space of that Building (unless on the Rooftop) takes 2D6 Wounds, ignoring Defense."
    },
    {
      "roll": "3",
      "description": "3 Creeping Darkness – The Darkness is always searching for a way out! Move the Darkness 2 steps forward on the Depth Track."
    },
    {
      "roll": "4",
      "description": "4 Blinding Sun – The burning sun beats down from above, glaring in your eyes and making you squint. Until end of the turn, all Heroes are -1 on their To Hit Rolls (6+ still counts as a Critical Hit)."
    },
    {
      "roll": "5",
      "description": "5 Screaming in the Distance – A scream of pain and suffering echoes in the distance, chilling you to the bone. Each Hero immediately takes D6 Horror Hits."
    },
    {
      "roll": "6",
      "description": "6 A Line is Drawn – This is it! Somebody’s got to save this Town and you’re not about to give up now! Each Hero may immediately Heal D6 Wounds/Sanity (any mix) or Recover 1 Grit. KO’d Heroes may immediately Recover, rolling for their Injury/Madness and Healing 2D6 Wounds/Sanity (any mix) as normal for Recovering."
    }
  ],
  "BlastedWastes": [
    {
      "roll": "1",
      "description": "1 Ambush Attack - There are fiendish creatures and demons in the dark places of the world! Ambush Attack! Draw a threat to immediately Ambush the Heroes."
    },
    {
      "roll": "2",
      "description": "2 Dark Dread – Things are looking more and more bleak by the moment! Draw a Growing Dread card to add to the stack."
    },
    {
      "roll": "3",
      "description": "3 Creeping Darkness – The Darkness is always searching for a way out! Move the Darkness 2 steps forward on the Depth Track."
    },
    {
      "roll": "4",
      "description": "4 Twin Suns – The twin suns of the Blasted Wastes move at a brisk pace, and can be unforgiving to those traveling through the deserts, day or night. Advance the Sun Track 1 position."
    },
    {
      "roll": "5",
      "description": "5 Magnetic Arcing - A molten Dark Stone core churns at the heart of the Blasted Wastes causing frequent quakes, sand storms, and magnetic pulses which disrupt and arc off of electrical equipment.  Every Hero takes 2 Hits for every Tech item or Tech Token they carry."
    },
    {
      "roll": "6",
      "description": "6 Weather the Storm - Discard any Weather or Storm currently in play. Each hero can recover 1 Grit. KO’d Heroes may immediately Recover, rolling for their Injury/Madness and Healing 2D6 Wounds/Sanity (any mix) as normal for Recovering."
    }
  ],
  "Canyon": [
    {
      "roll": "1",
      "description": "1 Ambush Attack - There are fiendish creatures and demons in the dark places of the world! Ambush Attack! Draw a threat to immediately Ambush the Heroes."
    },
    {
      "roll": "2",
      "description": "2 Dark Dread – Things are looking more and more bleak by the moment! Draw a Growing Dread card to add to the stack."
    },
    {
      "roll": "3",
      "description": "3 Creeping Darkness – The Darkness is always searching for a way out! Move the Darkness 2 steps forward on the Depth Track."
    },
    {
      "roll": "4",
      "description": "4 Rockslide – The Canyon cliffs are unstable and prone to rockslides. Each Hero in the Canyons takes D3 Hits for 3 Dmg each"
    },
    {
      "roll": "5",
      "description": "5 Being Watched – You can't shake the feeling that you are being watched. The next Attack in the Canyons is an Ambush.  If that is already the case immediate ambush attack. Draw a Threat card."
    },
    {
      "roll": "6",
      "description": "6 Stubborn Resolve – This place is horrible and unforgiving, but you’re not about to give up without a fight! Each Hero may immediately Heal D6 Wounds/Sanity (any mix) or Recover 1 Grit. KO’d Heroes may immediately Recover, rolling for their Injury/Madness and Healing 2D6 Wounds/Sanity (any mix) as normal for Recovering."
    }
  ],
  "Belly": [
    {
      "roll": "1",
      "description": "1 Ambush Attack - There are fiendish creatures and demons in the dark places of the world! Ambush Attack! Draw a threat to immediately Ambush the Heroes."
    },
    {
      "roll": "2",
      "description": "2 Dark Dread – Things are looking more and more bleak by the moment! Draw a Growing Dread card to add to the stack."
    },
    {
      "roll": "3",
      "description": "3 Creeping Darkness – The Darkness is always searching for a way out! Move the Darkness 2 steps forward on the Depth Track."
    },
    {
      "roll": "4",
      "description": "4 Bursting Pustules – Polyps and pustules lining the walls begin to expand and burst showering you in burning and sizzling fluids. Every hero must roll a D6.  On a roll of 1-3, gain a Bleeding marker."
    },
    {
      "roll": "5",
      "description": "5 Raining Mucus – The heavy and humid air within the massive chambers of the beast begins to condense creating a rainfall of sticky, itching mucus. Weather - While in the Belly of the Beast, a Hero takes 1 automatic Horror Hit at the start of each turn (stacks if rolled multiple times)."
    },
    {
      "roll": "6",
      "description": "6 Fight for Survival – Every step you take in the living world is a struggle for survival as you fend off the nightmarish creatures and burning acids that inhabit the belly of this massive beast! Each Hero may Recover Grit up to their Max.. KO’d Heroes may immediately Recover, rolling for their Injury/Madness and Healing 2D6 Wounds/Sanity (any mix) as normal for Recovering."
    }
  ],
  "Forest": [
    {
      "roll": "1",
      "description": "1 Ambush Attack - Among the decayed and twisted trees, terrible things lurk, waiting to pounce. Draw a threat to immediately Ambush the Heroes."
    },
    {
      "roll": "2",
      "description": "2 Dark Dread – Things are looking more and more bleak by the moment! Draw a Growing Dread card to add to the stack."
    },
    {
      "roll": "3",
      "description": "3 Creeping Darkness – The Darkness is always searching for a way out! Move the Darkness 2 steps forward on the Depth Track."
    },
    {
      "roll": "4",
      "description": "4 Dark Influence – The evil of the dark forest can be felt with every step in the moist earth, and every breath of fetid air.  Each Hero takes 1 Corruption Hit."
    },
    {
      "roll": "5",
      "description": "5 Malign Spirits – Scratching and clawing at you with their icy fingers, the dark spirits of the wood tear at your body and mind! Each Hero immediately takes 2 Hits and 2 Horror Hits each do Dmg/Sanity Damage equal to your level."
    },
    {
      "roll": "6",
      "description": "6 Not All Has Fallen to Shadow – A bright spirit emerges from the fog, a Hero of old to aid you in your passage through this terrifying realm. Each Hero may immediately remove any Status effect markers, as weall as Heal 2D6 Wounds/Sanity (any mix) or Recover 1 Grit. KO’d Heroes may immediately Recover, do not roll for their Injury/Madness and Healing 2D6 Wounds/Sanity (any mix) as normal for Recovering."
    }
  ],
  "Fortress": [
    {
      "roll": "1",
      "description": "1 Ambush Attack - There are fiendish creatures and demons in the dark places of the world! Ambush Attack! Draw a threat to immediately Ambush the Heroes."
    },
    {
      "roll": "2",
      "description": "2 Dark Dread – Things are looking more and more bleak by the moment! Draw a Growing Dread card to add to the stack."
    },
    {
      "roll": "3",
      "description": "3 Creeping Darkness – The Darkness is always searching for a way out! Move the Darkness 2 steps forward on the Depth Track."
    },
    {
      "roll": "4",
      "description": "4 Splintered Collapse – the broken and splintered ceiling of the fortress is unstable and prone to collapse. Each Hero in the Fortress immediately takes 3 Hits that do 2 Wounds each."
    },
    {
      "roll": "5",
      "description": "5 Echoing Laughter – A sinister and booming laughter echoes through the fortress, chilling you to the bone. Each Hero in the Fortress immediately takes 3 Horror Hits that do 2 Sanity Damage each."
    },
    {
      "roll": "6",
      "description": "6 Stubborn Resolve – This place is horrible and unforgiving, but you’re not about to give up without a fight! Each Hero may immediately Heal D6 Wounds/Sanity (any mix) or Recover 1 Grit. KO’d Heroes may immediately Recover, rolling for their Injury/Madness and Healing 2D6 Wounds/Sanity (any mix) as normal for Recovering."
    }
  ]
}
